{"data":{"markdownRemark":{"html":"<h3>Failed downloads:</h3>\n<h3>Failed hexagons:</h3>\n<h3>Hexagons images:</h3>\n<p><img src=\"/browser_particles_hexagon-fb7eba9b36bf9ccb6f2c398a7d87bca6.png\" alt=\"browser_particles_hexagon.png\"></p>","frontmatter":{"path":"/browser_particles_images","title":"Browser Particles","date":"2013-07-29","tags":["programming"]}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"prev":{"html":"<p> <a href=\"/pgs-905f50325ad14c02b4437e6b51a19cb0.png\"><img src=\"/pgs-905f50325ad14c02b4437e6b51a19cb0.png\"></a></p>\n<p>All the <a href=\"http://box2dflash.sourceforge.net/\">Box2D</a> documentation says to use the automatic gear joint and not to mess with simulating gears this way ...so it had to be done! A little trigonometry and fidgeting with sizes produced this simple planetary set:</p>\n<!-- swfobject.embedSWF(\"http://www.beigerecords.com/joe/sites/default/files/plexpinballmodule.swf\", \"planetary\", \"400\", \"400\", \"9.0.0\"); // -->\n<p>I quickly modified my sprocket construction code to make the annulus and spent a while scratching my head before remembering that the shape vertices have to be defined clockwise. Once they were, everything was interacting. But in all honesty, I have to nudge the annulus to get it going no matter how much torque I apply to the sun gear. It would be great to understand why if you know. And it would be really cool to develop an \"eccentric drive\" or two like these:</p>\n<embed src=\"http://www.youtube.com/v/QP5LN9jcsz4&amp;hl=en&amp;fs=1&amp;\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"425\" height=\"344\">  \n<embed src=\"http://www.youtube.com/v/8dR38uQN74c&amp;hl=en&amp;fs=1&amp;\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"425\" height=\"344\">  \nand eventually...  \n<embed src=\"http://www.youtube.com/v/pHO1JTNPPOU&amp;hl=en&amp;fs=1&amp;\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"560\" height=\"340\">","id":"2379e124-d2ac-5e7f-b997-614313236a1a","frontmatter":{"path":"/box2d_planetary_gear_set","title":"Box2D Planetary Gear Set","date":"2009-09-17","tags":["physics","programming"],"hexagonImages":["pgs.png_hexagon.png"]}},"next":{"html":"<p>I have been working on a mobile game with M&#x26;M Entertainment again, and our new game calls for a particle-based animation on top of the gameboard. I went to work in OpenGL ES building an Objective-C module for the mostly-complete Titanium app. Setting up the GLKit view, textures and geometries, communicating which textures are needed and when, and then cleaning up the objects after they are used turns out to be a pretty complex set of tasks. That stuff produces great results, but was eating more time that I would have preferred. I decided to use a WebView and \"HTML5\" techniques to render a graphics on top of the gameboard.</p>\n<p>The question then became how to render the dynamic particles and move them in the most performant way in a webkit browser. A quick internet search returned loads of articles about turning on the GPU by using <code>translateZ</code> in CSS3. It's true that elements with that bit of CSS will be sent to the GPU. But, in the case of dynamically positioned particles, every time we set the position in CSS, the element would have to be sent again to the GPU. In 2D CSS, it turns out faster to just move the particles without the GPU. Here is an example of doing that smoothly with 500 small images.</p>\n<p>The &#x3C;canvas> element provides a way to render dynamic particles with the GPU. <a href=\"https://bl.ocks.org/jbeuckm/5971531\">Here</a> is an example that moves 2000 particles with the canvas. It works great on webkit in iOS and we're using it for the game.</p>\n<p><img src=\"/browser_particles-231eaf14724423fdb52d1f1df0e841be.png\" alt=\"browser_particles.png\"></p>\n<p>Where WebGL is available, it enables the best possible performance for the dynamic particles. There are demos with one or two MILLIONs of particles that work smoothly in the browser.</p>","id":"ece24362-5b75-5dfe-a6e2-4d277b24108c","frontmatter":{"path":"/browser_particles","title":"Browser Particles","date":"2013-07-29","tags":["programming"],"hexagonImages":["browser_particles_hexagon.png"]}}}}