{"data":{"markdownRemark":{"html":"<p> <a href=\"/dsc02355_0-f93b5871eed1307a3969a4d70c2944de.jpg\"><img src=\"/dsc02355_0-f93b5871eed1307a3969a4d70c2944de.jpg\"></a></p>\n<p>Last week I took a fun last-minute trip to watch the last launch of space shuttle Atlantis. On the plane, I sat next to super-nice-guy, marine biologist, and real-life treasure hunter Ken Hayes. He has astronauts for friends and had a VIP pass to Kennedy Space Center! He's interested in storytelling and shared several fascinating ones on the flight from Philly down to Orlando. After the launch, he was headed to the Keys to continue recovery efforts of the famous Spanish galleon <a href=\"http://en.wikipedia.org/wiki/Spanish_ship_Nuestra_Se%C3%B1ora_de_Atocha_%281620%29\">Atocha</a>, lost at sea during hurricane season 1622. He showed me this handmade coin, which is worth about the same now as it was in the 1600's.</p>\n<p><img src=\"/dsc03820-38de6c8c4bbbcf4bcad216daa152ebc5.jpg\" alt=\"dsc03820\" title=\"dsc03820\"></p>\n<p><img src=\"/dsc03819-e27d6786b1090581169555db77e883c6.jpg\" alt=\"dsc03819\" title=\"dsc03819\"></p>\n<p>An estimated 300,000 people came to watch the third-last space shuttle launch. Here was the view from <a href=\"http://www.titusville.com/Page.asp?NavID=207\">Space View Park</a>.</p>\n<p><img src=\"/dsc03845-f31361cc42c5da79d9a6ded63f7928a8.jpg\" alt=\"dsc03845\" title=\"dsc03845\"></p>\n<p>Ken sent me this picture from where he watched with astronauts and celebrities.</p>\n<p><img src=\"/dsc02355-f93b5871eed1307a3969a4d70c2944de.jpg\" alt=\"Ken&#x27;s close view\" title=\"dsc02355\"></p>\n<p>I saw the bright flame and huge smoke plume from my spot in Titusville. And about a minute after liftoff, we heard and felt the constant thunder of the engines start and fade out as the shuttle's tiny dot was lost. A shuttle launch is a truly awesome spectacle and I recommend everyone see one of the last two this fall if you haven't already.</p>","frontmatter":{"path":"/florida_trip","title":"Florida Trip","date":"2010-05-21","tags":[]}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}