{"data":{"markdownRemark":{"html":"<h3>Failed downloads:</h3>\n<h3>Failed hexagons:</h3>\n<h3>Hexagons images:</h3>\n<p> <img src=\"/dsc04081.jpg_hexagon-f4be1a06ec14e163a7781a75401214e8.jpeg\" alt=\"dsc04081.jpg_hexagon.jpeg\">\n<img src=\"/dsc04080.jpg_hexagon-1ad02463d1fb8b42f0b3a16f16f1a51b.jpeg\" alt=\"dsc04080.jpg_hexagon.jpeg\">\n<img src=\"/dsc04082.jpg_hexagon-ff0dd2081625c6a20a7a19fbded61ec2.jpeg\" alt=\"dsc04082.jpg_hexagon.jpeg\"></p>","frontmatter":{"path":"/cnc_part_4_images","title":"CNC Part 4 (images)","date":"2011-05-18","tags":["CNC"]}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"prev":{"html":"<p>I've been reading loads of posts from cnczone.com, which is an incredible resource. This design based on an instructables.com article has clearly become a tool to learn about the mechanisms involved, rather than a desirable machine.</p>\n<p>I picked up an <a href=\"http://www.pcworld.com/reviews/product/13971/review/dimension_8200_24ghz.html\">old PC</a> with CRT monitor for $30 on craigslist which is more than adequate for CNC. I made a boot-cd with <a href=\"http://www.dakeng.com/turbo.html\">TurboCNC</a> and used an <a href=\"http://www.schmalzhaus.com/EasyDriver/\">EasyDriver</a> board to test the X and Y axes. It turns out that tubing will torque-couple the motor to the threaded rod, but can not keep them coaxial and concentric. There was some binding and the axes were not viable, at least at the small current and voltage available from the EasyDriver. I got the axes moving decently at slow speeds but will need at least the rated power of these stepper motors to move them well. To reduce friction as much as possible, I swapped the aluminum slider guides for skate bearings, which conveniently use the same holes. All but one of the plastic Menards guide wheels are also replaced by skate bearings. I drilled concentric holes in pieces of hard maple to serve as replacement shaft couplers to reduce binding. Hot glue holds them in place.</p>\n<p> <a href=\"/dsc04049-3a9e94b118258cbfffffc1d968d9178f.jpg\"><img src=\"/dsc04049-3a9e94b118258cbfffffc1d968d9178f.jpg\" alt=\"bearing detail\" title=\"dsc04049\"></a> </p>\n<p>I tested the EasyDriver beyond its rated 30V and promptly smoked it. I think it's a great driver board but not for this purpose. Hopefully, supplying my steppers with their rated current and extra voltage will make them viable for this machine. It's obvious from dozens of posts on cnczone.com that the <a href=\"http://geckodrive.com/product.aspx?c=3&#x26;i=14469\">Gecko G540 CNC Controller</a> is the best choice for this machine and will be able to control much larger/better machines if I build one of those. I'm saving for the G540 and will be testing with that asap.</p>\n<p>In the mean time, I built up the rest of the Z axis.</p>\n<p><a href=\"/dsc04051-7a84fe04f88f57449e25031fab489c78.jpg\"><img src=\"/dsc04051-7a84fe04f88f57449e25031fab489c78.jpg\" alt=\"cnc z-axis detail\" title=\"dsc04051\"></a> </p>\n<p>Even with skate bearings replacing the aluminum slides and plastic alignment wheel, this axis is probably too difficult to move with the cheap stepper. I will be testing at full power when the Gecko arrives but could see having to upgrade at least the Z motor.</p>\n<p><a href=\"/dsc04052-732c437b58d9755713acc2d77773b337.jpg\"><img src=\"/dsc04052-732c437b58d9755713acc2d77773b337.jpg\" alt=\"cnc update wide shot\" title=\"dsc04052\"></a></p>\n<p>Lesson: Cutting corners to save a few bucks often leads to a complicated or unusable machine. For instance, the skate bearings are barely more expensive than the plastic wheels were, but provide a low-friction replacement with very tight tolerances. The motors were cheap but aren't adequate for this size of machine. Same for the $15 EasyDriver, RIP.</p>","id":"6fedfed6-49f1-5712-a601-3f52171191ca","frontmatter":{"path":"/cnc_part_3","title":"CNC Part 3","date":"2011-01-05","tags":["CNC"],"hexagonImages":["dsc04052.jpeg_hexagon.jpeg","dsc04049-300x225.jpg_hexagon.jpeg","dsc04051-225x300.jpg_hexagon.jpeg","dsc04052-300x225.jpg_hexagon.jpeg","dsc04049.jpg_hexagon.jpeg","dsc04051.jpg_hexagon.jpeg","dsc04052.jpg_hexagon.jpeg"]}},"next":{"html":"<p>My first departure was a learning experience but is over. The cost of good motors and the gecko controller call for a machine with commensurate capabilities to be worthwhile. Fine Line Automation offers a popular kit called FLA-100 and posts free plans for the machine on their website. I decided to save for the entire kit and electronics. Then ABC Electronics got in a good load of 80/20 and my willpower gave out. A little at a time, my FLA-100 clone begins. <a href=\"/dsc04081-e6c02ecaa8b4aae662bf0bc1c12efa62.jpg\"><img src=\"/dsc04081-e6c02ecaa8b4aae662bf0bc1c12efa62.jpg\" alt=\"dsc04081\" title=\"dsc04081\"></a></p>\n<p>This is a cheap sacrificial multipurpose blade. Very slow and steadied feeds gave an acceptable finish even without lube. I sprayed WD40 continuously to trim the more important lengths and got a nicer finish than I expected with the Craftsman.</p>\n<p><a href=\"/dsc04080-a03fa14b58a6ae745962dca3e825e138.jpg\"><img src=\"/dsc04080-a03fa14b58a6ae745962dca3e825e138.jpg\" alt=\"dsc04080\" title=\"dsc04080\"></a></p>\n<p>There is a considerable amount of tapping involved.</p>\n<p><a href=\"/dsc04082-5312ea48fa7d0463a1df5510ed3a66e8.jpg\"><img src=\"/dsc04082-5312ea48fa7d0463a1df5510ed3a66e8.jpg\" alt=\"dsc04082\" title=\"dsc04082\"></a></p>\n<p>Here are the parts for the base and leftover bits. I realized after buying that this 80/20 is metric 40mm-based instead of 1-1/2\" per the plan. I ordered 2-1/2\" 1018 rails from DiscountSteel.com to drill myself so that the overhang is 1/2\" for the carriages from CNCRouterParts.com. Luckily, everything else works out if I switch to 1-1/2\"-based 80/20 from the carriages on.</p>","id":"a5c4298b-f610-5a9a-9a01-84aaa16a1694","frontmatter":{"path":"/cnc_part_4","title":"CNC Part 4","date":"2011-05-18","tags":["CNC"],"hexagonImages":["dsc04081.jpeg_hexagon.jpeg","dsc04081.jpg_hexagon.jpeg","dsc04080.jpg_hexagon.jpeg","dsc04082.jpg_hexagon.jpeg"]}}}}